
namespace ElectronicObserver.Data
{
	public class ShipOrders
	{
		/// <summary>海防艦</summary>
		public static string[] Escort = {
			// 占守型（甲型）
			"占守",
			"国後",
			"八丈",
			"石垣",
			// 択捉型（甲型）
			"択捉",
			"松輪",
			"佐渡",
			"隠岐",
			"六連",
			"壱岐",
			"対馬",
			"若宮",
			"平戸",
			"福江",
			"天草",
			"満珠",
			"干珠",
			"笠戸",
			// 御蔵型（甲型）
			"御蔵",
			"三宅",
			"淡路",
			"能美",
			"倉橋",
			"屋代",
			"千振",
			"草垣",
			// 日振型（甲型）
			"日振",
			"大東",
			"昭南",
			"久米",
			"生名",
			"四阪",
			"崎戸",
			"目斗",
			"波太",
			"大津", // 未成
			"友知", // 未成
			// 鵜来型（甲型）
			"鵜来",
			"沖縄",
			"奄美",
			"粟国",
			"新南",
			"屋久",
			"竹生",
			"神津",
			"保高",
			"伊唐",
			"生野",
			"蔚美", // 未成
			"室津", // 未成
			"稲木",
			"羽節",
			"男鹿",
			"金輪",
			"宇久",
			"高根",
			"久賀",
			"志賀",
			"伊王",
		};

		/// <summary>駆逐艦</summary>
		public static string[] Destoryer = {
			// 神風型
			"神風",
			"朝風",
			"春風",
			"松風",
			"旗風",
			"追風",
			"疾風",
			"朝凪",
			"夕凪",
			// 睦月型
			"睦月",
			"如月",
			"弥生",
			"卯月",
			"皐月",
			"水無月",
			"文月",
			"長月",
			"菊月",
			"三日月",
			"望月",
			"夕月",
			// 吹雪型（特I型）
			"吹雪",
			"白雪",
			"初雪",
			"深雪",
			"叢雲",
			"東雲",
			"薄雲",
			"白雲",
			"磯波",
			"浦波",
			// 綾波型（特II型）
			"綾波",
			"敷波",
			"朝霧",
			"夕霧",
			"天霧",
			"狭霧",
			"朧",
			"曙",
			"漣",
			"潮",
			// 暁型（特III型）
			"暁",
			"響",
			"雷",
			"電",
			// 初春型
			"初春",
			"子日",
			"若葉",
			"初霜",
			// 改初春型
			"有明",
			"夕暮",
			// 白露型
			"白露",
			"時雨",
			"村雨",
			"夕立",
			"春雨",
			"五月雨",
			// 改白露型
			"海風",
			"山風",
			"江風",
			"涼風",
			// 朝潮型
			"朝潮",
			"大潮",
			"満潮",
			"荒潮",
			"朝雲",
			"山雲",
			"夏雲",
			"峯雲",
			"霞",
			"霰",
			// 陽炎型（甲型）
			"陽炎",
			"不知火",
			"黒潮",
			"親潮",
			"早潮",
			"夏潮",
			"初風",
			"雪風",
			"天津風",
			"時津風",
			"浦風",
			"磯風",
			"浜風",
			"谷風",
			"野分",
			"嵐",
			"萩風",
			"舞風",
			"秋雲",
			// 夕雲型（甲型）
			"夕雲",
			"巻雲",
			"風雲",
			"長波",
			"巻波",
			"高波",
			"大波",
			"清波",
			"玉波",
			"涼波",
			"藤波",
			"早波",
			"浜波",
			"沖波",
			"岸波",
			"朝霜",
			"早霜",
			"秋霜",
			"清霜",
			// 秋月型（乙型）
			"秋月",
			"照月",
			"涼月",
			"初月",
			"新月",
			"若月",
			"霜月",
			"冬月",
			"春月",
			"宵月",
			"夏月",
			"満月", // 未成
			"花月",
			// 島風型（丙型）
			"島風",

			// [ドイツ] Z1型（1934型）
			"Z1",
			"Z2",
			"Z3",
			"Z4",

			// [イタリア] マエストラーレ級（ヴェンティ級）
			"Maestrale",
			"Grecale",
			"Libeccio",
			"Scirocco",

			// [イギリス] J級
			"Jervis",

			// [ソ連] 20号計画型
			"Ташкент",

			// [アメリカ] ジョン・C・バトラー級護衛駆逐艦
			"Samuel B.Roberts",
		};

		/// <summary>軽巡洋艦・練習巡洋艦</summary>
		public static string[] LightCruiser = {
			// 天龍型
			"天龍",
			"龍田",
			// 球磨型
			"球磨",
			"多摩",
			"北上",
			"大井",
			"木曾",
			// 長良型
			"長良",
			"五十鈴",
			"名取",
			"由良",
			"鬼怒",
			"阿武隈",
			// 川内型
			"川内",
			"神通",
			"那珂",
			"加古", // 建造中止
			// 夕張型
			"夕張",
			// 香取型
			"香取",
			"鹿島",
			"香椎",
			"橿原", // 未成
			// 阿賀野型
			"阿賀野",
			"能代",
			"矢矧",
			"酒匂",
			// 大淀型
			"大淀",
			"仁淀", // 未起工
		};

		/// <summary>重巡洋艦</summary>
		public static string[] HeavyCruiser = {
			// 古鷹型
			"古鷹",
			"加古",
			// 青葉型
			"青葉",
			"衣笠",
			// 妙高型
			"妙高",
			"那智",
			"足柄",
			"羽黒",
			// 高雄型
			"高雄",
			"愛宕",
			"鳥海",
			"摩耶",
			// 最上型
			"最上",
			"三隈",
			"鈴谷",
			"熊野",
			// 利根型
			"利根",
			"筑摩",
			// 改鈴谷型
			"伊吹",

			// [ドイツ] アドミラル・ヒッパー級
			"Admiral Hipper",
			"Blücher",
			"Prinz Eugen",
			"Seydlitz",
			"Lützow",

			// [イタリア] ザラ級
			"Zara",
			"Fiume",
			"Gorizia",
			"Pola",
		};

		/// <summary>巡洋戦艦・戦艦・航空戦艦（IJN戦船年代順、未実装艦略）</summary>
		public static string[] Battleship = {
			// 金剛型
			"金剛",
			"比叡",
			"榛名",
			"霧島",

			// 扶桑型
			"扶桑",
			"山城",

			// 伊勢型
			"伊勢",
			"日向",

			// 長門型
			"長門",
			"陸奥",

			// 大和型
			"大和",
			"武蔵",

			// [ドイツ] ビスマルク級
			"Bismarck",
			
			// [イタリア] ヴィットリオ・ヴェネト級（リットリオ級）
			"Littorio",
			"Roma",

			// [アメリカ] アイオワ級
			"Iowa",

			// [イギリス] クイーン・エリザベス級
			"Warspite",

			// [フランス] リシュリュー級
			"Richelieu",

			// [ロシア] ガングート級
			"Гангут", // → [ソ連] Октябрьская революция
		};

		/// <summary>軽空母・正規空母・装甲空母（IJN戦船年代順、未実装艦略）</summary>
		public static string[] AircraftCarrier = {
			"鳳翔",
			"加賀",
			"赤城", // 改造航空母艦 赤城型（←巡洋戦艦）
			"龍驤",
			"蒼龍",
			"飛龍",

			// 翔鶴型
			"翔鶴",
			"瑞鶴",

			// 祥鳳型 ( ※ 瑞鳳型の場合 瑞鳳-祥鳳 )
			"祥鳳",
			"瑞鳳",

			// 商船改造航空母艦 飛鷹型（←特設航空母艦）
			"飛鷹",
			"隼鷹",

			// 商船改造航空母艦 大鷹型（←特設航空母艦）
			"春日丸", // → 大鷹

			// 大鳳型
			"大鳳",

			// 雲龍型
			"雲龍",
			"天城",
			"葛城",
			
			// [ドイツ] グラーフ・ツェッペリン級
			"Graf Zeppelin",
			
			// [イタリア]
			"Aquila",

			// [アメリカ] レキシントン級
			"Saratoga",

			// [アメリカ] エセックス級
			"Intrepid",

			// [アメリカ] カサブランカ級
			"Gambier Bay",

			// [イギリス]
			"Ark Royal",
		};


		/// <summary>水上機母艦（未実装艦略）</summary>
		public static string[] SeaplaneTender = {
			// 千歳型（→航空母艦）
			"千歳",
			"千代田",
			//
			"瑞穂",
			// 秋津洲型
			"秋津洲",

			// [フランス]
			"Commandant Teste",
		};

		/// <summary>給油艦（未実装艦略）</summary>
		public static string[] FleetOiler = {
			"神威", // → 水上機母艦
			"速吸",
		};


		/// <summary> 潜水艦・潜水空母・三式潜航輸送艇（未実装艦略）</summary>
		public static string[] Submarine = {
			// （伊68型→）伊168型（海大6型A）
			"伊168", // ← 伊68
			// 伊7型（巡潜3型）
			"伊8",
			// 伊13型（甲型改2）
			"伊13",
			"伊14",
			// 伊15型（乙型）
			"伊19",
			"伊26",
			// 伊54型（乙型改2）
			"伊58",
			// 伊400型（特型）
			"伊400",
			"伊401",

			// [ドイツ] UボートIXC型
			"U-511",

			// [イタリア] グリエルモ・マルコーニ級
			"Luigi Torelli",

			// [陸軍] 三式潜航輸送艇
			"まるゆ",
		};

		/// <summary>潜水母艦（未実装艦略）</summary>
		public static string[] SubmarineTender = {
			// 大鯨型
			"大鯨",
		};

		/// <summary>工作艦（未実装艦略）</summary>
		public static string[] RepairShip = {
			"明石",
		};

		/// <summary>揚陸艦</summary>
		public static string[] AmphibiousAssaultShip = {
			// [陸軍] 特種船 丙型
			"あきつ丸",
		};
	}
}
